Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.2.273/atdf/PIC32CM1216LE00032.atdf
        <module name="FPB" id="SYSTEM_IP" version="1.0.0">
          <instance name="FPB">
            <register-group name="FPB" name-in-module="FPB" address-space="base" offset="0xE0002000"/>
            <parameters>
              <param name="__BKPT_NUM" value="4" caption="Number of FPB breakpoint comparators"/>
            </parameters>
          </instance>
        </module>
        <module name="FREQM" id="U2257" name2="U2257" version="2.2.0">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x40002C00"/>
            <parameters>
              <param name="GCLK_ID_MSR" value="5" caption="Index of measure generic clock"/>
              <param name="GCLK_ID_REF" value="6" caption="Index of reference generic clock"/>
              <param name="INSTANCE_ID" value="11" caption="Instance index for FREQM"/>
            </parameters>
          </instance>
        </module>
        <module name="GCLK" id="U2122" name2="U2122" version="1.1.2">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x40001C00"/>
            <signals>
              <signal group="IO" index="0" function="H" pad="PA30"/>
              <signal group="IO" index="0" function="H" pad="PA14"/>
              <signal group="IO" index="1" function="H" pad="PA23"/>
              <signal group="IO" index="1" function="H" pad="PA15"/>
              <signal group="IO" index="2" function="H" pad="PA16"/>
              <signal group="IO" index="2" function="H" pad="PA22"/>
              <signal group="IO" index="3" function="H" pad="PA17"/>
              <signal group="IO" index="4" function="H" pad="PA10"/>
            </signals>
            <parameters>
              <param name="GENDIV_BITS" value="16"/>
              <param name="GEN_BITS" value="3"/>
              <param name="GEN_NUM" value="5" caption="Number of Generic Clock Generators"/>
              <param name="GEN_NUM_MSB" value="4" caption="Number of Generic Clock Generators - 1"/>
              <param name="GEN_SOURCE_NUM_MSB" value="8" caption="Number of Generic Clock Sources - 1"/>
              <param name="NUM" value="35" caption="Number of Generic Clock Users"/>
              <param name="SOURCE_BITS" value="4"/>
              <param name="SOURCE_NUM" value="9" caption="Number of Generic Clock Sources"/>
              <param name="INSTANCE_ID" value="7" caption="Instance index for GCLK"/>
            </parameters>
          </instance>
        </module>
        <module name="ICB" id="SYSTEM_IP" version="1.0.0">
          <instance name="ICB">
            <register-group name="ICB" name-in-module="ICB" address-space="base" offset="0xE000E000"/>
          </instance>
        </module>
        <module name="MCLK" id="U2234" name2="U2234" version="3.1.0">
          <instance name="MCLK">
            <register-group name="MCLK" name-in-module="MCLK" address-space="base" offset="0x40000800"/>
            <parameters>
              <param name="MCLK_CLK_APB_NUM" value="3"/>
              <param name="SYSTEM_CLOCK" value="1000000" caption="System Clock Frequency at Reset"/>
              <param name="INSTANCE_ID" value="2" caption="Instance index for MCLK"/>
            </parameters>
            <clock-groups>
              <clock-group name="AHB" grouporder="0">
                <clock name="APBA" bit="0"/>
                <clock name="APBB" bit="1"/>
                <clock name="APBC" bit="2"/>
                <clock name="DMAC" bit="3"/>
                <clock name="DSU" bit="4"/>
                <clock name="PAC" bit="6"/>
                <clock name="NVMCTRL" bit="7"/>
                <clock name="TRAM" bit="12"/>
                <clock name="USB" bit="13"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
        <module name="MPU" id="SYSTEM_IP" version="1.0.0">
          <instance name="MPU">
            <register-group name="MPU" name-in-module="MPU" address-space="base" offset="0xE000ED90"/>
            <parameters>
              <param name="__MPU_REGIONS" value="12" caption="Number of MPU regions"/>
            </parameters>
          </instance>
        </module>
        <module name="NVIC" id="SYSTEM_IP" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E100"/>
            <parameters>
              <param name="NUM_IRQ" value="71" caption="Number of interrupt request lines"/>
            </parameters>
          </instance>
        </module>
        <module name="NVMCTRL" id="U2802" name2="U2802" version="1.1.0">
          <instance name="NVMCTRL">
            <register-group name="NVMCTRL" name-in-module="NVMCTRL" address-space="base" offset="0x41004000"/>
            <signals>
              <signal group="MARGIN" function="default" pad="VMARGIN"/>
            </signals>
            <parameters>
              <param name="DATAFLASH_PAGES" value="64"/>
              <param name="PMSB" value="3"/>
              <param name="PSZ_BITS" value="6"/>
              <param name="ROW_PAGES" value="4"/>
              <param name="SECURE_IMPLEMENTED" value="1" caption="Security Configuration implemented?"/>
              <param name="FLASH_SIZE" value="131072"/>
              <param name="PAGE_SIZE" value="64"/>
              <param name="PAGES" value="2048"/>
              <param name="PAGES_PR_REGION" value="128"/>
              <param name="INSTANCE_ID" value="34" caption="Instance index for NVMCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="U2802" name2="U2802" version="1.1.0">
          <instance name="FUSES">
            <register-group name="BOCOR_FUSES" name-in-module="BOCOR_FUSES" address-space="fuses" offset="0x0080C000"/>
            <register-group name="OTP1_FUSES" name-in-module="OTP1_FUSES" address-space="fuses" offset="0x00806000"/>
            <register-group name="OTP2_FUSES" name-in-module="OTP2_FUSES" address-space="fuses" offset="0x00806008"/>
            <register-group name="SW_CALIB_FUSES" name-in-module="SW_CALIB_FUSES" address-space="fuses" offset="0x00806020"/>
