Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.2.273/atdf/PIC32CM1216LE00032.atdf
        <module name="SCB" id="SYSTEM_IP" version="1.0.0">
          <instance name="SCB">
            <register-group name="SCB" name-in-module="SCB" address-space="base" offset="0xE000ED00"/>
          </instance>
        </module>
        <module name="SERCOM" id="U2201" name2="com_sercom_u2201_v6" version="6b1">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x42000400"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA04" ioset="2"/>
              <signal group="PAD" index="0" function="D" pad="PA16" ioset="3"/>
              <signal group="PAD" index="0" function="C" pad="PA22" ioset="1"/>
              <signal group="PAD" index="1" function="D" pad="PA05" ioset="2"/>
              <signal group="PAD" index="1" function="D" pad="PA17" ioset="3"/>
              <signal group="PAD" index="1" function="C" pad="PA23" ioset="1"/>
              <signal group="PAD" index="2" function="D" pad="PA06" ioset="2"/>
              <signal group="PAD" index="2" function="D" pad="PA14" ioset="3"/>
              <signal group="PAD" index="2" function="D" pad="PA18" ioset="3"/>
              <signal group="PAD" index="2" function="C" pad="PA24" ioset="1"/>
              <signal group="PAD" index="2" function="D" pad="PA02" ioset="2"/>
              <signal group="PAD" index="3" function="D" pad="PA07" ioset="2"/>
              <signal group="PAD" index="3" function="D" pad="PA15" ioset="3"/>
              <signal group="PAD" index="3" function="D" pad="PA19" ioset="3"/>
              <signal group="PAD" index="3" function="C" pad="PA25" ioset="1"/>
              <signal group="PAD" index="3" function="D" pad="PA03" ioset="2"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="4" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="5" caption="Index of DMA TX trigger"/>
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?"/>
              <param name="FIFO_SIZE" value="8" caption="Rx-Tx FIFO size in bytes"/>
              <param name="FSYNC_IMPLEMENTED" value="0" caption="SPI Frame Synch mode implemented?"/>
              <param name="GCLK_ID_CORE" value="17"/>
              <param name="GCLK_ID_SLOW" value="16"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="1" caption="TWI HighSpeed mode implemented?"/>
              <param name="ULTRA_IMPLEMENTATION" value="1" caption="ULTRA platform compatibility?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="65" caption="Instance index for SERCOM0"/>
              <param name="SPI_TX_READY_INT_SRC" value="31" caption="SPI TX READY Interrupt"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="32" caption="SPI TX COMPLETE Interrupt"/>
              <param name="SPI_RX_INT_SRC" value="33" caption="SPI RX Interrupt"/>
              <param name="SPI_ERROR_INT_SRC" value="34" caption="SPI ERROR Interrupt"/>
              <param name="I2C_0_INT_SRC" value="31" caption="I2C 0 Interrupt"/>
              <param name="I2C_1_INT_SRC" value="32" caption="I2C 1 Interrupt"/>
              <param name="I2C_2_INT_SRC" value="33" caption="I2C 2 Interrupt"/>
              <param name="I2C_3_INT_SRC" value="34" caption="I2C 3 Interrupt"/>
              <param name="USART_TX_READY_INT_SRC" value="31" caption="USART TX READY Interrupt"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="32" caption="USART TX COMPLETE Interrupt"/>
              <param name="USART_RX_INT_SRC" value="33" caption="USART RX Interrupt"/>
              <param name="USART_ERROR_INT_SRC" value="34" caption="USART ERROR Interrupt"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x42000800"/>
            <signals>
              <signal group="PAD" index="0" function="C" pad="PA16" ioset="3"/>
              <signal group="PAD" index="0" function="C" pad="PA08" ioset="1"/>
              <signal group="PAD" index="0" function="D" pad="PA00" ioset="2"/>
              <signal group="PAD" index="1" function="C" pad="PA17" ioset="3"/>
              <signal group="PAD" index="1" function="C" pad="PA09" ioset="1"/>
              <signal group="PAD" index="1" function="D" pad="PA01" ioset="2"/>
              <signal group="PAD" index="2" function="C" pad="PA18" ioset="3"/>
              <signal group="PAD" index="2" function="C" pad="PA10" ioset="1 2"/>
              <signal group="PAD" index="2" function="D" pad="PA30" ioset="2"/>
              <signal group="PAD" index="3" function="C" pad="PA19" ioset="3"/>
              <signal group="PAD" index="3" function="D" pad="PA31" ioset="2"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="6" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="7" caption="Index of DMA TX trigger"/>
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?"/>
              <param name="FIFO_SIZE" value="8" caption="Rx-Tx FIFO size in bytes"/>
              <param name="FSYNC_IMPLEMENTED" value="0" caption="SPI Frame Synch mode implemented?"/>
              <param name="GCLK_ID_CORE" value="18"/>
              <param name="GCLK_ID_SLOW" value="16"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="1" caption="TWI HighSpeed mode implemented?"/>
              <param name="ULTRA_IMPLEMENTATION" value="1" caption="ULTRA platform compatibility?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="66" caption="Instance index for SERCOM1"/>
              <param name="SPI_TX_READY_INT_SRC" value="35" caption="SPI TX READY Interrupt"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="36" caption="SPI TX COMPLETE Interrupt"/>
              <param name="SPI_RX_INT_SRC" value="37" caption="SPI RX Interrupt"/>
              <param name="SPI_ERROR_INT_SRC" value="38" caption="SPI ERROR Interrupt"/>
              <param name="I2C_0_INT_SRC" value="35" caption="I2C 0 Interrupt"/>
              <param name="I2C_1_INT_SRC" value="36" caption="I2C 1 Interrupt"/>
              <param name="I2C_2_INT_SRC" value="37" caption="I2C 2 Interrupt"/>
              <param name="I2C_3_INT_SRC" value="38" caption="I2C 3 Interrupt"/>
              <param name="USART_TX_READY_INT_SRC" value="35" caption="USART TX READY Interrupt"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="36" caption="USART TX COMPLETE Interrupt"/>
              <param name="USART_RX_INT_SRC" value="37" caption="USART RX Interrupt"/>
              <param name="USART_ERROR_INT_SRC" value="38" caption="USART ERROR Interrupt"/>
            </parameters>
          </instance>
