Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.2.273/atdf/PIC32CM1216LE00032.atdf
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x10"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="COMP0" caption="Comparator 0" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0" mask="0x10"/>
        </register>
        <register name="STATUSA" offset="0x7" rw="R" size="1" initval="0x00" caption="Status A">
          <bitfield name="STATE0" caption="Comparator 0 Current State" mask="0x1"/>
          <bitfield name="STATE1" caption="Comparator 1 Current State" mask="0x2"/>
          <bitfield name="WSTATE0" caption="Window 0 Current State" mask="0x30" values="AC_STATUSA__WSTATE0"/>
        </register>
        <register name="STATUSB" offset="0x8" rw="R" size="1" initval="0x00" caption="Status B">
          <bitfield name="READY0" caption="Comparator 0 Ready" mask="0x1"/>
          <bitfield name="READY1" caption="Comparator 1 Ready" mask="0x2"/>
        </register>
        <register name="DBGCTRL" offset="0x9" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register name="WINCTRL" offset="0xA" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Window Control">
          <bitfield name="WEN0" caption="Window 0 Mode Enable" mask="0x1"/>
          <bitfield name="WINTSEL0" caption="Window 0 Interrupt Selection" mask="0x6" values="AC_WINCTRL__WINTSEL0"/>
        </register>
        <register name="SCALER" offset="0xC" rw="RW" size="1" count="2" initval="0x00" caption="Scaler n">
          <bitfield name="VALUE" caption="Scaler Value" mask="0x3F"/>
        </register>
        <register name="COMPCTRL" offset="0x10" rw="RW" access="WSYNC" size="4" count="2" initval="0x00000000" caption="Comparator Control n">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="SINGLE" caption="Single-Shot Mode" mask="0x4"/>
          <bitfield name="INTSEL" caption="Interrupt Selection" mask="0x18" values="AC_COMPCTRL__INTSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="MUXNEG" caption="Negative Input Mux Selection" mask="0x700" values="AC_COMPCTRL__MUXNEG"/>
          <bitfield name="MUXPOS" caption="Positive Input Mux Selection" mask="0x7000" values="AC_COMPCTRL__MUXPOS"/>
          <bitfield name="SWAP" caption="Swap Inputs and Invert" mask="0x8000"/>
          <bitfield name="SPEED" caption="Speed Selection" mask="0x30000" values="AC_COMPCTRL__SPEED"/>
          <bitfield name="HYSTEN" caption="Hysteresis Enable" mask="0x80000"/>
          <bitfield name="HYST" caption="Hysteresis Level" mask="0x300000" values="AC_COMPCTRL__HYST"/>
          <bitfield name="FLEN" caption="Filter Length" mask="0x7000000" values="AC_COMPCTRL__FLEN"/>
          <bitfield name="OUT" caption="Output" mask="0x30000000" values="AC_COMPCTRL__OUT"/>
        </register>
        <register name="SYNCBUSY" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="WINCTRL" caption="WINCTRL Synchronization Busy" mask="0x4"/>
          <bitfield name="COMPCTRL0" caption="COMPCTRL 0 Synchronization Busy" mask="0x8"/>
          <bitfield name="COMPCTRL1" caption="COMPCTRL 1 Synchronization Busy" mask="0x10"/>
        </register>
      </register-group>
      <value-group name="AC_STATUSA__WSTATE0">
        <value name="ABOVE" caption="Signal is above window" value="0"/>
        <value name="INSIDE" caption="Signal is inside window" value="1"/>
        <value name="BELOW" caption="Signal is below window" value="2"/>
      </value-group>
      <value-group name="AC_WINCTRL__WINTSEL0">
        <value name="ABOVE" caption="Interrupt on signal above window" value="0"/>
        <value name="INSIDE" caption="Interrupt on signal inside window" value="1"/>
        <value name="BELOW" caption="Interrupt on signal below window" value="2"/>
        <value name="OUTSIDE" caption="Interrupt on signal outside window" value="3"/>
      </value-group>
      <value-group name="AC_COMPCTRL__FLEN">
        <value name="OFF" caption="No filtering" value="0"/>
        <value name="MAJ3" caption="3-bit majority function (2 of 3)" value="1"/>
        <value name="MAJ5" caption="5-bit majority function (3 of 5)" value="2"/>
      </value-group>
      <value-group name="AC_COMPCTRL__HYST">
        <value name="HYST50" caption="50mV" value="0"/>
        <value name="HYST70" caption="70mV" value="1"/>
        <value name="HYST90" caption="90mV" value="2"/>
        <value name="HYST110" caption="110mV" value="3"/>
      </value-group>
      <value-group name="AC_COMPCTRL__INTSEL">
        <value name="TOGGLE" caption="Interrupt on comparator output toggle" value="0"/>
        <value name="RISING" caption="Interrupt on comparator output rising" value="1"/>
        <value name="FALLING" caption="Interrupt on comparator output falling" value="2"/>
        <value name="EOC" caption="Interrupt on end of comparison (single-shot mode only)" value="3"/>
      </value-group>
      <value-group name="AC_COMPCTRL__MUXNEG">
        <value name="AIN0" caption="I/O pin 0 for COMPCTRL0/1" value="0"/>
        <value name="AIN1" caption="I/O pin 1 for COMPCTRL0/1" value="1"/>
        <value name="AIN2" caption="I/O pin 2 for COMPCTRL0/1" value="2"/>
        <value name="AIN3" caption="I/O pin 3 for COMPCTRL0/1" value="3"/>
        <value name="AVSS" caption="Ground" value="4"/>
        <value name="VSCALE" caption="AVDD Scaler" value="5"/>
        <value name="BANDGAP" caption="Internal Bandgap Voltage" value="6"/>
        <value name="DAC" caption="DAC Voltage Output 0 for COMPCTRL0" value="7"/>
        <value name="OPAMP2" caption="OPAMP2 Output for COMPCTRL1" value="7"/>
      </value-group>
