Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.2.273/atdf/PIC32CM1216LE00032.atdf
        <register name="INTENSET" offset="0x10" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="EXTINT0" caption="External Interrupt 0 Enable" mask="0x1"/>
          <bitfield name="EXTINT1" caption="External Interrupt 1 Enable" mask="0x2"/>
          <bitfield name="EXTINT2" caption="External Interrupt 2 Enable" mask="0x4"/>
          <bitfield name="EXTINT3" caption="External Interrupt 3 Enable" mask="0x8"/>
          <bitfield name="EXTINT4" caption="External Interrupt 4 Enable" mask="0x10"/>
          <bitfield name="EXTINT5" caption="External Interrupt 5 Enable" mask="0x20"/>
          <bitfield name="EXTINT6" caption="External Interrupt 6 Enable" mask="0x40"/>
          <bitfield name="EXTINT7" caption="External Interrupt 7 Enable" mask="0x80"/>
        </register>
        <register name="INTFLAG" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="EXTINT0" caption="External Interrupt 0" mask="0x1"/>
          <bitfield name="EXTINT1" caption="External Interrupt 1" mask="0x2"/>
          <bitfield name="EXTINT2" caption="External Interrupt 2" mask="0x4"/>
          <bitfield name="EXTINT3" caption="External Interrupt 3" mask="0x8"/>
          <bitfield name="EXTINT4" caption="External Interrupt 4" mask="0x10"/>
          <bitfield name="EXTINT5" caption="External Interrupt 5" mask="0x20"/>
          <bitfield name="EXTINT6" caption="External Interrupt 6" mask="0x40"/>
          <bitfield name="EXTINT7" caption="External Interrupt 7" mask="0x80"/>
        </register>
        <register name="ASYNCH" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="External Interrupt Asynchronous Mode">
          <bitfield name="ASYNCH0" caption="Asynchronous Edge Detection Mode of EXTINT0" mask="0x1" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH1" caption="Asynchronous Edge Detection Mode of EXTINT1" mask="0x2" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH2" caption="Asynchronous Edge Detection Mode of EXTINT2" mask="0x4" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH3" caption="Asynchronous Edge Detection Mode of EXTINT3" mask="0x8" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH4" caption="Asynchronous Edge Detection Mode of EXTINT4" mask="0x10" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH5" caption="Asynchronous Edge Detection Mode of EXTINT5" mask="0x20" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH6" caption="Asynchronous Edge Detection Mode of EXTINT6" mask="0x40" values="EIC_ASYNCH__ASYNCH"/>
          <bitfield name="ASYNCH7" caption="Asynchronous Edge Detection Mode of EXTINT7" mask="0x80" values="EIC_ASYNCH__ASYNCH"/>
        </register>
        <register name="CONFIG0" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="External Interrupt Sense Configuration">
          <bitfield name="SENSE0" caption="Input Sense Configuration 0" mask="0x7" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN0" caption="Filter Enable 0" mask="0x8"/>
          <bitfield name="SENSE1" caption="Input Sense Configuration 1" mask="0x70" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN1" caption="Filter Enable 1" mask="0x80"/>
          <bitfield name="SENSE2" caption="Input Sense Configuration 2" mask="0x700" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN2" caption="Filter Enable 2" mask="0x800"/>
          <bitfield name="SENSE3" caption="Input Sense Configuration 3" mask="0x7000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN3" caption="Filter Enable 3" mask="0x8000"/>
          <bitfield name="SENSE4" caption="Input Sense Configuration 4" mask="0x70000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN4" caption="Filter Enable 4" mask="0x80000"/>
          <bitfield name="SENSE5" caption="Input Sense Configuration 5" mask="0x700000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN5" caption="Filter Enable 5" mask="0x800000"/>
          <bitfield name="SENSE6" caption="Input Sense Configuration 6" mask="0x7000000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN6" caption="Filter Enable 6" mask="0x8000000"/>
          <bitfield name="SENSE7" caption="Input Sense Configuration 7" mask="0x70000000" values="EIC_CONFIG__SENSE"/>
          <bitfield name="FILTEN7" caption="Filter Enable 7" mask="0x80000000"/>
        </register>
        <register name="DEBOUNCEN" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="Debouncer Enable">
          <bitfield name="DEBOUNCEN0" caption="Debouncer Enable of EXTINT0" mask="0x1"/>
          <bitfield name="DEBOUNCEN1" caption="Debouncer Enable of EXTINT1" mask="0x2"/>
          <bitfield name="DEBOUNCEN2" caption="Debouncer Enable of EXTINT2" mask="0x4"/>
          <bitfield name="DEBOUNCEN3" caption="Debouncer Enable of EXTINT3" mask="0x8"/>
          <bitfield name="DEBOUNCEN4" caption="Debouncer Enable of EXTINT4" mask="0x10"/>
          <bitfield name="DEBOUNCEN5" caption="Debouncer Enable of EXTINT5" mask="0x20"/>
          <bitfield name="DEBOUNCEN6" caption="Debouncer Enable of EXTINT6" mask="0x40"/>
          <bitfield name="DEBOUNCEN7" caption="Debouncer Enable of EXTINT7" mask="0x80"/>
        </register>
        <register name="DPRESCALER" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="Debouncer Prescaler">
          <bitfield name="PRESCALER0" caption="Debouncer Prescaler" mask="0x7" values="EIC_DPRESCALER__PRESCALER"/>
          <bitfield name="STATES0" caption="Debouncer number of states" mask="0x8" values="EIC_DPRESCALER__STATES"/>
          <bitfield name="TICKON" caption="Pin Sampler frequency selection" mask="0x10000" values="EIC_DPRESCALER__TICKON"/>
        </register>
        <register name="PINSTATE" offset="0x38" rw="R" size="4" initval="0x00000000" caption="Pin State">
          <bitfield name="PINSTATE0" caption="Pin State of EXTINT0" mask="0x1"/>
          <bitfield name="PINSTATE1" caption="Pin State of EXTINT1" mask="0x2"/>
          <bitfield name="PINSTATE2" caption="Pin State of EXTINT2" mask="0x4"/>
          <bitfield name="PINSTATE3" caption="Pin State of EXTINT3" mask="0x8"/>
          <bitfield name="PINSTATE4" caption="Pin State of EXTINT4" mask="0x10"/>
          <bitfield name="PINSTATE5" caption="Pin State of EXTINT5" mask="0x20"/>
          <bitfield name="PINSTATE6" caption="Pin State of EXTINT6" mask="0x40"/>
          <bitfield name="PINSTATE7" caption="Pin State of EXTINT7" mask="0x80"/>
        </register>
      </register-group>
      <value-group name="EIC_CTRLA__CKSEL">
        <value name="CLK_GCLK" caption="Clocked by GCLK" value="0"/>
        <value name="CLK_ULP32K" caption="Clocked by ULP32K" value="1"/>
      </value-group>
