Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.2.273/atdf/PIC32CM1216LE00032.atdf
        <register name="BUSYCH" offset="0x18" rw="R" size="4" initval="0x00000000" caption="Busy Channels">
          <bitfield name="BUSYCH0" caption="Busy Channel 0" mask="0x1"/>
          <bitfield name="BUSYCH1" caption="Busy Channel 1" mask="0x2"/>
          <bitfield name="BUSYCH2" caption="Busy Channel 2" mask="0x4"/>
          <bitfield name="BUSYCH3" caption="Busy Channel 3" mask="0x8"/>
          <bitfield name="BUSYCH4" caption="Busy Channel 4" mask="0x10"/>
          <bitfield name="BUSYCH5" caption="Busy Channel 5" mask="0x20"/>
          <bitfield name="BUSYCH6" caption="Busy Channel 6" mask="0x40"/>
          <bitfield name="BUSYCH7" caption="Busy Channel 7" mask="0x80"/>
        </register>
        <register name="READYUSR" offset="0x1C" rw="R" size="4" initval="0xFFFFFFFF" caption="Ready Users">
          <bitfield name="READYUSR0" caption="Ready User for Channel 0" mask="0x1"/>
          <bitfield name="READYUSR1" caption="Ready User for Channel 1" mask="0x2"/>
          <bitfield name="READYUSR2" caption="Ready User for Channel 2" mask="0x4"/>
          <bitfield name="READYUSR3" caption="Ready User for Channel 3" mask="0x8"/>
          <bitfield name="READYUSR4" caption="Ready User for Channel 4" mask="0x10"/>
          <bitfield name="READYUSR5" caption="Ready User for Channel 5" mask="0x20"/>
          <bitfield name="READYUSR6" caption="Ready User for Channel 6" mask="0x40"/>
          <bitfield name="READYUSR7" caption="Ready User for Channel 7" mask="0x80"/>
        </register>
        <register-group name="CHANNEL" name-in-module="CHANNEL" offset="0x020" size="0x8" count="8"/>
        <register name="USER" offset="0x120" rw="RW" size="1" count="28" initval="0x00" caption="User Multiplexer n">
          <bitfield name="CHANNEL" caption="Channel Event Selection" mask="0xF"/>
        </register>
      </register-group>
      <value-group name="EVSYS_CHANNEL__EDGSEL">
        <value name="NO_EVT_OUTPUT" caption="No event output when using the resynchronized or synchronous path" value="0"/>
        <value name="RISING_EDGE" caption="Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path" value="1"/>
        <value name="FALLING_EDGE" caption="Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path" value="2"/>
        <value name="BOTH_EDGES" caption="Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path" value="3"/>
      </value-group>
      <value-group name="EVSYS_CHANNEL__PATH">
        <value name="SYNCHRONOUS" caption="Synchronous path" value="0"/>
        <value name="RESYNCHRONIZED" caption="Resynchronized path" value="1"/>
        <value name="ASYNCHRONOUS" caption="Asynchronous path" value="2"/>
      </value-group>
    </module>
    <module name="FPB" version="1.0.0" caption="Flash Patch and Breakpoint">
      <register-group name="FPB" caption="Flash Patch and Breakpoint">
        <register name="FP_CTRL" offset="0x0" rw="RW" size="4" access-size="4" caption="Flash Patch Control Register">
          <bitfield name="ENABLE" caption="Flash Patch global enable" mask="0x1"/>
          <bitfield name="KEY" caption="FP_CTRL write-enable key" mask="0x2"/>
          <bitfield name="NUM_CODE" caption="Number of implemented code comparators bits [3:0]" mask="0xF0"/>
          <bitfield name="NUM_LIT" caption="Number of literal comparators" mask="0xF00"/>
          <bitfield name="NUM_CODE_1" caption="Number of implemented code comparators bits [6:4]" mask="0x7000"/>
          <bitfield name="REV" caption="Revision" mask="0xF0000000"/>
        </register>
        <register name="FP_REMAP" offset="0x4" rw="R" size="4" access-size="4" caption="Flash Patch Remap Register">
          <bitfield name="REMAP" caption="Remap address" mask="0x1FFFFFE0"/>
          <bitfield name="RMPSPT" caption="Remap supported" mask="0x20000000"/>
        </register>
        <register name="FP_COMP" offset="0x8" rw="RW" size="4" access-size="4" count="4" caption="Flash Patch Comparator Register n">
          <mode name="BREAKPOINT"/>
          <mode name="DEFAULT"/>
          <bitfield name="BE" caption="Breakpoint enable" mask="0x1"/>
          <bitfield modes="DEFAULT" name="FPADDR" caption="Flash Patch address" mask="0x1FFFFFFC"/>
          <bitfield modes="DEFAULT" name="FE" caption="Flash Patch enable" mask="0x80000000"/>
          <bitfield modes="BREAKPOINT" name="BPADDR" caption="Breakpoint address" mask="0xFFFFFFFE"/>
        </register>
        <register name="FP_LAR" offset="0xFB0" rw="W" size="4" access-size="4" caption="FPB Software Lock Access Register">
          <bitfield name="KEY" caption="Lock access control" mask="0xFFFFFFFF" values="FPB_FP_LAR__KEY"/>
        </register>
        <register name="FP_LSR" offset="0xFB4" rw="R" size="4" access-size="4" caption="FPB Software Lock Status Register">
          <bitfield name="SLI" caption="Software Lock implemented" mask="0x1"/>
          <bitfield name="SLK" caption="Software Lock status" mask="0x2"/>
          <bitfield name="nTT" caption="Not thirty-two bit" mask="0x4"/>
        </register>
        <register name="FP_DEVARCH" offset="0xFBC" rw="R" size="4" access-size="4" initval="0x47701A03" caption="FPB Device Architecture Register">
          <bitfield name="ARCHPART" caption="Architecture Part" mask="0xFFF"/>
          <bitfield name="ARCHVER" caption="Architecture Version" mask="0xF000"/>
          <bitfield name="REVISION" caption="Revision" mask="0xF0000"/>
          <bitfield name="PRESENT" caption="DEVARCH Present" mask="0x100000"/>
          <bitfield name="ARCHITECT" caption="Architect" mask="0xFFE00000"/>
        </register>
        <register name="FP_DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" initval="0x00000000" caption="FPB Device Type Register">
          <bitfield name="MAJOR" caption="Major type" mask="0xF"/>
          <bitfield name="SUB" caption="Sub-type" mask="0xF0"/>
        </register>
        <register name="FP_PIDR4" offset="0xFD0" rw="R" size="4" access-size="4" caption="FP Peripheral Identification Register 4">
          <bitfield name="DES_2" caption="JEP106 continuation code" mask="0xF"/>
          <bitfield name="SIZE" caption="4KB count" mask="0xF0"/>
        </register>
        <register name="FP_PIDR5" offset="0xFD4" rw="R" size="4" access-size="4" initval="0x00000000" caption="FP Peripheral Identification Register 5">
        </register>
        <register name="FP_PIDR6" offset="0xFD8" rw="R" size="4" access-size="4" initval="0x00000000" caption="FP Peripheral Identification Register 6">
        </register>
        <register name="FP_PIDR7" offset="0xFDC" rw="R" size="4" access-size="4" initval="0x00000000" caption="FP Peripheral Identification Register 7">
        </register>
        <register name="FP_PIDR0" offset="0xFE0" rw="R" size="4" access-size="4" caption="FP Peripheral Identification Register 0">
          <bitfield name="PART_0" caption="Part number bits[7:0]" mask="0xFF"/>
        </register>
