Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.2.273/atdf/PIC32CM1216LE00032.atdf
      <value-group name="SCB_AIRCR__BFHFNMINS">
        <value name="SECURE" caption="BusFault, HardFault, and NMI are Secure" value="0x0"/>
        <value name="NON_SECURE" caption="BusFault and NMI are Non-secure and exceptions can target Non-secure HardFault" value="0x1"/>
      </value-group>
      <value-group name="SCB_AIRCR__ENDIANNESS">
        <value name="LITTLE" caption="Little-endian" value="0"/>
        <value name="BIG" caption="Big-endian" value="1"/>
      </value-group>
      <value-group name="SCB_AIRCR__PRIS">
        <value name="SAME" caption="Priority ranges of Secure and Non-secure exceptions are identical" value="0x0"/>
        <value name="NS_DEPRIO" caption="Non-secure exceptions are de-prioritized" value="0x1"/>
      </value-group>
      <value-group name="SCB_AIRCR__SYSRESETREQ">
        <value name="NO" caption="Do not request a system reset" value="0"/>
        <value name="YES" caption="Request a system reset" value="1"/>
      </value-group>
      <value-group name="SCB_AIRCR__SYSRESETREQS">
        <value name="BOTH" caption="SYSRESETREQ functionality is available to both Security states" value="0x0"/>
        <value name="SECURE" caption="SYSRESETREQ functionality is only available to Secure state" value="0x1"/>
      </value-group>
      <value-group name="SCB_AIRCR__VECTCLRACTIVE">
        <value name="NO" caption="Do not clear active state" value="0x0"/>
        <value name="YES" caption="Clear active state" value="0x1"/>
      </value-group>
      <value-group name="SCB_SCR__SEVONPEND">
        <value name="VALUE_0" caption="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded" value="0"/>
        <value name="VALUE_1" caption="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor" value="1"/>
      </value-group>
      <value-group name="SCB_SCR__SLEEPDEEP">
        <value name="VALUE_0" caption="Sleep" value="0"/>
        <value name="VALUE_1" caption="Deep sleep" value="1"/>
      </value-group>
      <value-group name="SCB_SCR__SLEEPONEXIT">
        <value name="VALUE_0" caption="O not sleep when returning to Thread mode" value="0"/>
        <value name="VALUE_1" caption="Enter sleep, or deep sleep, on return from an ISR" value="1"/>
      </value-group>
      <value-group name="SCB_CCR__UNALIGN_TRP">
        <value name="VALUE_0" caption="Do not trap unaligned halfword and word accesses" value="0"/>
        <value name="VALUE_1" caption="Trap unaligned halfword and word accesses" value="1"/>
      </value-group>
      <value-group name="SCB_CLIDR__Ctype">
        <value name="NO" caption="No cache" value="0"/>
        <value name="IC" caption="Instruction cache only" value="1"/>
        <value name="DC" caption="Data cache only" value="2"/>
        <value name="SEPARATE" caption="Separate instruction and data caches" value="3"/>
        <value name="UNIFIED" caption="Unified cache" value="4"/>
      </value-group>
      <value-group name="SCB_CLIDR__ICB">
        <value name="NO" caption="Not disclosed in this mechanism" value="0"/>
        <value name="L1" caption="L1 cache is the highest inner level" value="1"/>
        <value name="L2" caption="L2 cache is the highest inner level" value="2"/>
        <value name="L3" caption="L3 cache is the highest inner level" value="3"/>
      </value-group>
      <value-group name="SCB_CTR__Format">
        <value name="NO" caption="No cache type information provided" value="0"/>
        <value name="YES" caption="Cache type information is provided" value="4"/>
      </value-group>
    </module>
    <module name="SERCOM" id="03715" version="6b0" caption="Serial Communication Interface">
      <register-group name="SERCOM" caption="Serial Communication Interface">
        <mode name="I2CM" qualifier="SERCOM.I2CM_CTRLA.MODE" mask="6" value="5" caption="I2C Master Mode"/>
        <mode name="I2CS" qualifier="SERCOM.I2CS_CTRLA.MODE" mask="6" value="4" caption="I2C Slave Mode"/>
        <mode name="SPIS" qualifier="SERCOM.SPIS_CTRLA.MODE" mask="6" value="2" caption="SPI Slave Mode"/>
        <mode name="SPIM" qualifier="SERCOM.SPIM_CTRLA.MODE" mask="6" value="3" caption="SPI Master Mode"/>
        <mode name="USART_EXT" qualifier="SERCOM.USART_CTRLA.MODE" mask="6" value="0" caption="USART EXTERNAL CLOCK Mode"/>
        <mode name="USART_INT" qualifier="SERCOM.USART_CTRLA.MODE" mask="6" value="1" caption="USART INTERNAL CLOCK Mode"/>
        <register modes="I2CM" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="I2CM Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x1C" values="SERCOM_I2CM_CTRLA__MODE"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x80"/>
          <bitfield name="PINOUT" caption="Pin Usage" mask="0x10000"/>
          <bitfield name="SDAHOLD" caption="SDA Hold Time" mask="0x300000" values="SERCOM_I2CM_CTRLA__SDAHOLD"/>
          <bitfield name="MEXTTOEN" caption="Master SCL Low Extend Timeout" mask="0x400000"/>
          <bitfield name="SEXTTOEN" caption="Slave SCL Low Extend Timeout" mask="0x800000"/>
          <bitfield name="SPEED" caption="Transfer Speed" mask="0x3000000" values="SERCOM_I2CM_CTRLA__SPEED"/>
          <bitfield name="SCLSM" caption="SCL Clock Stretch Mode" mask="0x8000000"/>
          <bitfield name="INACTOUT" caption="Inactive Time-Out" mask="0x30000000" values="SERCOM_I2CM_CTRLA__INACTOUT"/>
          <bitfield name="LOWTOUTEN" caption="SCL Low Timeout Enable" mask="0x40000000"/>
        </register>
        <register modes="I2CS" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="I2CS Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x1C" values="SERCOM_I2CS_CTRLA__MODE"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80"/>
          <bitfield name="PINOUT" caption="Pin Usage" mask="0x10000"/>
          <bitfield name="SDAHOLD" caption="SDA Hold Time" mask="0x300000" values="SERCOM_I2CS_CTRLA__SDAHOLD"/>
          <bitfield name="SEXTTOEN" caption="Slave SCL Low Extend Timeout" mask="0x800000"/>
          <bitfield name="SPEED" caption="Transfer Speed" mask="0x3000000" values="SERCOM_I2CS_CTRLA__SPEED"/>
          <bitfield name="SCLSM" caption="SCL Clock Stretch Mode" mask="0x8000000"/>
          <bitfield name="LOWTOUTEN" caption="SCL Low Timeout Enable" mask="0x40000000"/>
        </register>
        <register modes="SPIM" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="SPIM Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x1C" values="SERCOM_SPIM_CTRLA__MODE"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80"/>
          <bitfield name="IBON" caption="Immediate Buffer Overflow Notification" mask="0x100" values="SERCOM_SPIM_CTRLA__IBON"/>
          <bitfield name="DOPO" caption="Data Out Pinout" mask="0x30000" values="SERCOM_SPIM_CTRLA__DOPO"/>
          <bitfield name="DIPO" caption="Data In Pinout" mask="0x300000" values="SERCOM_SPIM_CTRLA__DIPO"/>
          <bitfield name="FORM" caption="Frame Format" mask="0xF000000" values="SERCOM_SPIM_CTRLA__FORM"/>
          <bitfield name="CPHA" caption="Clock Phase" mask="0x10000000" values="SERCOM_SPIM_CTRLA__CPHA"/>
          <bitfield name="CPOL" caption="Clock Polarity" mask="0x20000000" values="SERCOM_SPIM_CTRLA__CPOL"/>
          <bitfield name="DORD" caption="Data Order" mask="0x40000000" values="SERCOM_SPIM_CTRLA__DORD"/>
        </register>
